Load csv data into pandas and setup dataframe

In [1]:
%config Completer.use_jedi = False
from datetime import datetime, timedelta
import pandas as pd
from sqlalchemy import create_engine
import yfinance as yf
from config import *

In [2]:
# Store company csv into data frame
company_csv = "../resources/Company.csv"
company_df = pd.read_csv(company_csv)
# reset the df index and change the original index column name to "ID"
company_index=company_df.reset_index()
company_index=company_index.rename(columns={"index":"id"})
company_index

   id ticker_symbol company_name
0   0          AAPL        apple
1   1          GOOG   Google Inc
2   2         GOOGL   Google Inc
3   3          AMZN   Amazon.com
4   4          TSLA    Tesla Inc
5   5          MSFT    Microsoft

In [3]:
# Store tweet csv into data frame
tweet_csv = "../resources/Tweet.csv"
tweet_df = pd.read_csv(tweet_csv)

# drop the writer column
tweet_df=tweet_df[["tweet_id","post_date","body","comment_num","retweet_num","like_num"]]
tweet_df.head()

,tweet_id,post_date,body,comment_num,retweet_num,like_num
0,550441509175443456,1420070457,"lx21 made $10,008 on $AAPL -Check it out! htt...",0,0,1
1,550441672312512512,1420070496,Insanity of today weirdo massive selling. $aap...,0,0,0
2,550441732014223360,1420070510,S&P100 #Stocks Performance $HD $LOW $SBUX $TGT...,0,0,0
3,550442977802207232,1420070807,$GM $TSLA: Volkswagen Pushes 2014 Record Recal...,0,0,1
4,550443807834402816,1420071005,Swing Trading: Up To 8.91% Return In 14 Days h...,0,0,1

In [4]:
# Unix epoch start time
start = datetime(1970, 1, 1)  

# convert datetime to a more readable format
tweet_df['datetime'] =tweet_df.post_date.apply(lambda x: start + timedelta(seconds=x))

# strip off the time leaving only the dates
tweet_df['tweet_date']=pd.to_datetime(tweet_df['datetime']).dt.date
tweet_df_new=tweet_df[["tweet_id","body","comment_num","retweet_num","like_num","tweet_date"]]
tweet_df_new.head()

,tweet_id,body,comment_num,retweet_num,like_num,tweet_date
0,550441509175443456,"lx21 made $10,008 on $AAPL -Check it out! htt...",0,0,1,2015-01-01
1,550441672312512512,Insanity of today weirdo massive selling. $aap...,0,0,0,2015-01-01
2,550441732014223360,S&P100 #Stocks Performance $HD $LOW $SBUX $TGT...,0,0,0,2015-01-01
3,550442977802207232,$GM $TSLA: Volkswagen Pushes 2014 Record Recal...,0,0,1,2015-01-01
4,550443807834402816,Swing Trading: Up To 8.91% Return In 14 Days h...,0,0,1,2015-01-01

In [5]:
# Store company tweet csv into data frame
company_tweet = "../resources/Company_Tweet.csv"
company_tweet = pd.read_csv(company_tweet)

# reset the df index and change the original index column name to "ID"
tweet_index=company_tweet.reset_index()
tweet_index=tweet_index.rename(columns={"index":"id"})
tweet_index

              id             tweet_id ticker_symbol
0              0   550803612197457920          AAPL
1              1   550803610825928706          AAPL
2              2   550803225113157632          AAPL
3              3   550802957370159104          AAPL
4              4   550802855129382912          AAPL
...          ...                  ...           ...
4336440  4336440  1212158772015034369          TSLA
4336441  4336441  1212159099632267268          TSLA
4336442  4336442  1212159184931717120          TSLA
4336443  4336443  1212159838882533376          TSLA
4336444  4336444  1212160015332728833          TSLA

[4336445 rows x 3 columns]

Query stockdata from Yahoo Finance, load into pandas and setup dataframe

In [6]:
#query stock data from yahoo fianace for 5 companies
msft = yf.Ticker("MSFT")
aapl = yf.Ticker("AAPL")
goog = yf.Ticker("GOOG")
googl = yf.Ticker("GOOGL")
tsla = yf.Ticker("TSLA")

In [7]:
#extract MSFT stock data from yf, add ticker symbol and reset index
msft_stock = yf.download("MSFT", start="2015-01-01", end="2019-12-31")
msft_stock["ticker_symbol"]='MSFT'
msft_stock=msft_stock.reset_index()
msft_stock=msft_stock.rename(columns={"index":"id"})
msft_stock.head()

[*********************100%***********************]  1 of 1 completed

,Date,Open,High,Low,Close,Adj Close,Volume,ticker_symbol
0,2014-12-31,46.730000,47.439999,46.450001,46.450001,41.074078,21552500,MSFT
1,2015-01-02,46.660000,47.419998,46.540001,46.759998,41.348206,27913900,MSFT
2,2015-01-05,46.369999,46.730000,46.250000,46.330002,40.967976,39673900,MSFT
3,2015-01-06,46.380001,46.750000,45.540001,45.650002,40.366688,36447900,MSFT
4,2015-01-07,45.980000,46.459999,45.490002,46.230000,40.879539,29114100,MSFT

In [8]:
#extract GOOGL stock data from yf, add ticker symbol and reset index
googl_stock = yf.download("GOOGL", start="2015-01-01", end="2019-12-31")
googl_stock["ticker_symbol"]='GOOGL'
googl_stock=googl_stock.reset_index()
googl_stock=googl_stock.rename(columns={"index":"id"})
googl_stock.head()

[*********************100%***********************]  1 of 1 completed

,Date,Open,High,Low,Close,Adj Close,Volume,ticker_symbol
0,2014-12-31,537.739990,538.400024,530.200012,530.659973,530.659973,1232400,GOOGL
1,2015-01-02,532.599976,535.799988,527.880005,529.549988,529.549988,1324000,GOOGL
2,2015-01-05,527.150024,527.989990,517.750000,519.460022,519.460022,2059100,GOOGL
3,2015-01-06,520.500000,521.210022,505.549988,506.640015,506.640015,2722800,GOOGL
4,2015-01-07,510.950012,511.489990,503.649994,505.149994,505.149994,2345900,GOOGL

In [24]:
#extract GOOG stock data from yf, add ticker symbol
goog_stock = yf.download("GOOG", start="2015-01-01", end="2019-12-31")
goog_stock["ticker_symbol"]='GOOG'
goog_stock=goog_stock.reset_index()
goog_stock.head()

[*********************100%***********************]  1 of 1 completed

,Date,Open,High,Low,Close,Adj Close,Volume,ticker_symbol
0,2014-12-31,529.795471,531.141724,524.360352,524.958740,524.958740,1368246,GOOG
1,2015-01-02,527.561584,529.815369,522.665039,523.373108,523.373108,1447563,GOOG
2,2015-01-05,521.827332,522.894409,511.655243,512.463013,512.463013,2059840,GOOG
3,2015-01-06,513.589966,514.761719,499.678131,500.585632,500.585632,2899940,GOOG
4,2015-01-07,505.611847,505.855164,498.281952,499.727997,499.727997,2065054,GOOG

In [25]:
#extract AMZN stock data from yf, add ticker symbol and reset index
amzn_stock = yf.download("AMZN", start="2015-01-01", end="2019-12-31")
amzn_stock["ticker_symbol"]='AMZN'
amzn_stock=amzn_stock.reset_index()
amzn_stock.head()

[*********************100%***********************]  1 of 1 completed

,Date,Open,High,Low,Close,Adj Close,Volume,ticker_symbol
0,2014-12-31,311.549988,312.980011,310.010010,310.350006,310.350006,2048000,AMZN
1,2015-01-02,312.579987,314.750000,306.959991,308.519989,308.519989,2783200,AMZN
2,2015-01-05,307.010010,308.380005,300.850006,302.190002,302.190002,2774200,AMZN
3,2015-01-06,302.239990,303.000000,292.380005,295.290009,295.290009,3519000,AMZN
4,2015-01-07,297.500000,301.279999,295.329987,298.420013,298.420013,2640300,AMZN

In [26]:
#extract TSLA stock data from yf, add ticker symbol and reset index
tlsa_stock = yf.download("TSLA", start="2015-01-01", end="2019-12-31")
tlsa_stock["ticker_symbol"]='TSLA'
tlsa_stock=tlsa_stock.reset_index()
tlsa_stock.head()

[*********************100%***********************]  1 of 1 completed

,Date,Open,High,Low,Close,Adj Close,Volume,ticker_symbol
0,2014-12-31,44.618000,45.136002,44.450001,44.481998,44.481998,11487500,TSLA
1,2015-01-02,44.574001,44.650002,42.652000,43.862000,43.862000,23822000,TSLA
2,2015-01-05,42.910000,43.299999,41.431999,42.018002,42.018002,26842500,TSLA
3,2015-01-06,42.012001,42.840000,40.841999,42.256001,42.256001,31309500,TSLA
4,2015-01-07,42.669998,42.956001,41.956001,42.189999,42.189999,14842000,TSLA

In [27]:
#extract AAPL stock data from yf, add ticker symbol and reset index
aapl_stock = yf.download("AAPL", start="2015-01-01", end="2019-12-31")
aapl_stock["ticker_symbol"]='AAPL'
aapl_stock=aapl_stock.reset_index()
aapl_stock.head()

[*********************100%***********************]  1 of 1 completed

,Date,Open,High,Low,Close,Adj Close,Volume,ticker_symbol
0,2014-12-31,28.205000,28.282499,27.552500,27.594999,25.057606,165613600,AAPL
1,2015-01-02,27.847500,27.860001,26.837500,27.332500,24.819241,212818400,AAPL
2,2015-01-05,27.072500,27.162500,26.352501,26.562500,24.120045,257142000,AAPL
3,2015-01-06,26.635000,26.857500,26.157499,26.565001,24.122320,263188400,AAPL
4,2015-01-07,26.799999,27.049999,26.674999,26.937500,24.460564,160423600,AAPL

In [28]:
#append all stock dataframes together to create a complete dataset Stock_data
stock_data=pd.concat([aapl_stock, tlsa_stock,amzn_stock,goog_stock,googl_stock,msft_stock], ignore_index=True)
stock_data=stock_data.sort_values(by=['ticker_symbol', 'Date'])
stock_data=stock_data.reset_index()
stock_data=stock_data.rename(columns={"index":"id",'Date':'stock_date','Open':'open_price','Close':'close_price','Volume':'trading_volume'})
stock_data=stock_data[['id','ticker_symbol','stock_date','open_price','close_price','trading_volume']]
stock_data.head()

   id ticker_symbol stock_date  open_price  close_price  trading_volume
0   0          AAPL 2014-12-31   28.205000    27.594999       165613600
1   1          AAPL 2015-01-02   27.847500    27.332500       212818400
2   2          AAPL 2015-01-05   27.072500    26.562500       257142000
3   3          AAPL 2015-01-06   26.635000    26.565001       263188400
4   4          AAPL 2015-01-07   26.799999    26.937500       160423600

Connect to Pg4admin, create datatables in the database and load data into the created tables

In [17]:
# connect to local database
rds_connection_string = "{}:{}@localhost:5432/company_tweets".format(username,password)

engine = create_engine(f'postgresql://{rds_connection_string}')

In [18]:
# check table names
engine.table_names()

['tweet_index', 'stock_data', 'company_index', 'tweet_df_new']

In [19]:
# Use pandas to load csv converted DataFrame into database table name company_index
company_index.to_sql(name='company_index', con=engine, if_exists='append', index=False)

In [20]:
# Use pandas to load csv converted DataFrame into database table name tweet_df_new
tweet_df_new.to_sql(name='tweet_df_new', con=engine, if_exists='append', index=False)

In [21]:
# Use pandas to load csv converted DataFrame into database table name tweet_index
tweet_index.to_sql(name='tweet_index', con=engine, if_exists='append', index=False)

In [22]:
# Use pandas to load yahoo finance data converted DataFrame into database table name company_index
stock_data.to_sql(name='stock_data', con=engine, if_exists='append', index=False)